#include <stdio.h>

int main(){

    int list[100] =  {5, 8, 7, 0, 0, 2, 1, 9, 2, 8, 0, 2, 2, 4, 7, 5, 4, 9, 7, 7, 0, 0, 8, 6, 9, 9, 7, 4, 2, 7, 4, 7, 8, 1,

   9, 0, 5, 0, 0, 9, 1, 2, 4, 3, 6, 1, 8, 0, 0, 7, 0, 2, 8, 8, 8, 9, 7, 8, 3, 9, 7, 9, 8, 5, 2, 7, 8,

   7, 0, 0, 6, 1, 2, 2, 4, 8, 3, 4, 1, 5, 1, 1, 7, 1, 1, 8, 0, 8, 6, 5, 9, 5, 4, 7, 1, 8, 6, 1, 5, 6  };

    int cnt = 1;
    int max = 1;
    int i, num;

    for(i = 0; i < 99; i++){
        if(list[i] == list[i+1]){
            cnt++;
            if(max < cnt){
                max = cnt;
                num = list[i];
            }
        }
        else cnt = 1;
    }

    printf("연속으로 가장 길게 나타나는 수 : %d, 길이 : %d\n", num, max);
    
    return 0;
}